#### How to load data from csv file into dataframe?

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv('practical-10-a-empdata.csv')

In [ ]:
type(df)

pandas.core.frame.DataFrame

#### Observe dataset

In [ ]:
df.head()

   empid           ename       sal         doj
0   1001      Ganesh Rao  10000.00  10-10-2000
1   1002      Anil Kumar  23000.50   3-20-2002
2   1003    Gaurav Gupta  18000.53  03-03-2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000

In [ ]:
df.head(3)

   empid         ename       sal         doj
0   1001    Ganesh Rao  10000.00  10-10-2000
1   1002    Anil Kumar  23000.50   3-20-2002
2   1003  Gaurav Gupta  18000.53  03-03-2002

In [ ]:
df.tail()

   empid           ename       sal         doj
1   1002      Anil Kumar  23000.50   3-20-2002
2   1003    Gaurav Gupta  18000.53  03-03-2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000
5   1006       Anant Nag   9999.99  09-09-1999

In [ ]:
df.tail(3)

   empid           ename       sal         doj
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000
5   1006       Anant Nag   9999.99  09-09-1999

In [ ]:
df.shape

(6, 4)

In [ ]:
size = df.shape
print(size)
print(type(size))

(6, 4)
<class 'tuple'>

In [ ]:
print("No. of rows=",df.shape[0])
print("No. of columns=",df.shape[1])
print()
print("No. of rows=",size[0])
print("No. of columns=",size[1])

No. of rows= 6
No. of columns= 4

No. of rows= 6
No. of columns= 4

#### Retrieving range of rows

In [ ]:
df[2:5]

   empid           ename       sal         doj
2   1003    Gaurav Gupta  18000.53  03-03-2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000

In [ ]:
df[0:2]

   empid       ename      sal         doj
0   1001  Ganesh Rao  10000.0  10-10-2000
1   1002  Anil Kumar  23000.5   3-20-2002

In [ ]:
# Rows in reverse order
df[::-1]
# df[5::-1]
# df[5:0:-2]

   empid         ename       sal         doj
5   1006     Anant Nag   9999.99  09-09-1999
3   1004  Hema Chandra  16500.50  09-10-2000
1   1002    Anil Kumar  23000.50   3-20-2002

#### Retrieving column names

In [ ]:
df.columns

Index(['empid', 'ename', 'sal', 'doj'], dtype='object')

In [ ]:
cols = df.columns
print(cols)
print(type(cols))

Index(['empid', 'ename', 'sal', 'doj'], dtype='object')
<class 'pandas.core.indexes.base.Index'>

#### Retrieving column data

In [ ]:
# select empid from df
df.empid

0    1001
1    1002
2    1003
3    1004
4    1005
5    1006
Name: empid, dtype: int64

In [ ]:
# select ename from df
df.ename

0        Ganesh Rao
1        Anil Kumar
2      Gaurav Gupta
3      Hema Chandra
4    Laxmi Prasanna
5         Anant Nag
Name: ename, dtype: object

In [ ]:
df['empid']

0    1001
1    1002
2    1003
3    1004
4    1005
5    1006
Name: empid, dtype: int64

In [ ]:
# select empid, ename from df
df[['empid','ename']]

   empid           ename
0   1001      Ganesh Rao
1   1002      Anil Kumar
2   1003    Gaurav Gupta
3   1004    Hema Chandra
4   1005  Laxmi Prasanna
5   1006       Anant Nag

In [ ]:
opcols = ['empid','ename']
df[opcols]

   empid           ename
0   1001      Ganesh Rao
1   1002      Anil Kumar
2   1003    Gaurav Gupta
3   1004    Hema Chandra
4   1005  Laxmi Prasanna
5   1006       Anant Nag

In [ ]:
df['empid','ename']

KeyError: ('empid', 'ename')

#### Finding maximum and minimum values

In [ ]:
# select max(sal) from df
df['sal'].max()

23000.5

In [ ]:
df.sal.max()

23000.5

In [ ]:
df['sal'].min()

9999.99

#### Performing queries on data

In [ ]:
# show rows where sal is > 10000
# select * from df where sal > 10000

df[  df['sal']    >  10000   ]

# df[df.sal > 10000]

   empid           ename       sal         doj
1   1002      Anil Kumar  23000.50   3-20-2002
2   1003    Gaurav Gupta  18000.53  03-03-2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000

In [ ]:
# show rows where ename is Anant Nag
df[df.ename == 'Anant Nag']

   empid      ename      sal         doj
5   1006  Anant Nag  9999.99  09-09-1999

In [ ]:
# show rows where sal is maximum
maxsal = df.sal.max()
df[df.sal == maxsal]

# OR
# df[df.sal == df.sal.max()]

   empid       ename      sal        doj
1   1002  Anil Kumar  23000.5  3-20-2002

In [ ]:
# show selected columns only where sal is maximum
df[['empid','ename']][df.sal>10000]

   empid           ename
1   1002      Anil Kumar
2   1003    Gaurav Gupta
3   1004    Hema Chandra
4   1005  Laxmi Prasanna

#### Sorting data

In [ ]:
df

   empid           ename       sal         doj
0   1001      Ganesh Rao  10000.00  10-10-2000
1   1002      Anil Kumar  23000.50   3-20-2002
2   1003    Gaurav Gupta  18000.53  03-03-2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000
5   1006       Anant Nag   9999.99  09-09-1999

In [ ]:
df1 = df.sort_values('sal')
df1

   empid           ename       sal         doj
5   1006       Anant Nag   9999.99  09-09-1999
0   1001      Ganesh Rao  10000.00  10-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000
3   1004    Hema Chandra  16500.50  09-10-2000
2   1003    Gaurav Gupta  18000.53  03-03-2002
1   1002      Anil Kumar  23000.50   3-20-2002

In [ ]:
df1 = df.sort_values('ename',ascending=False) # descending order
df1

   empid           ename       sal         doj
4   1005  Laxmi Prasanna  12000.75  10-08-2000
3   1004    Hema Chandra  16500.50  09-10-2000
2   1003    Gaurav Gupta  18000.53  03-03-2002
0   1001      Ganesh Rao  10000.00  10-10-2000
1   1002      Anil Kumar  23000.50   3-20-2002
5   1006       Anant Nag   9999.99  09-09-1999

In [ ]:
df

   empid           ename       sal         doj
0   1001      Ganesh Rao  10000.00  10-10-2000
1   1002      Anil Kumar  23000.50   3-20-2002
2   1003    Gaurav Gupta  18000.53  03-03-2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000
5   1006       Anant Nag   9999.99  09-09-1999

In [ ]:
df1 = df.sort_values('doj')
df1

   empid           ename       sal         doj
2   1003    Gaurav Gupta  18000.53  03-03-2002
5   1006       Anant Nag   9999.99  09-09-1999
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000
0   1001      Ganesh Rao  10000.00  10-10-2000
1   1002      Anil Kumar  23000.50   3-20-2002

In [ ]:
# sort date
df = pd.read_csv('practical-12-a-empdata.csv',parse_dates=['doj']) # notice parameters

df

   empid           ename       sal        doj
0   1001      Ganesh Rao  10000.00 2000-10-10
1   1002      Anil Kumar  23000.50 2002-03-20
2   1003    Gaurav Gupta  18000.53 2002-03-03
3   1004    Hema Chandra  16500.50 2000-09-10
4   1005  Laxmi Prasanna  12000.75 2000-10-08
5   1006       Anant Nag   9999.99 1999-09-09

In [ ]:
# sort by date of joining
df1 = df.sort_values('doj')
df1

   empid           ename       sal        doj
5   1006       Anant Nag   9999.99 1999-09-09
3   1004    Hema Chandra  16500.50 2000-09-10
4   1005  Laxmi Prasanna  12000.75 2000-10-08
0   1001      Ganesh Rao  10000.00 2000-10-10
2   1003    Gaurav Gupta  18000.53 2002-03-03
1   1002      Anil Kumar  23000.50 2002-03-20

In [ ]:
df1 = df.sort_values('doj',ascending=False)
df1

   empid           ename       sal        doj
1   1002      Anil Kumar  23000.50 2002-03-20
2   1003    Gaurav Gupta  18000.53 2002-03-03
0   1001      Ganesh Rao  10000.00 2000-10-10
4   1005  Laxmi Prasanna  12000.75 2000-10-08
3   1004    Hema Chandra  16500.50 2000-09-10
5   1006       Anant Nag   9999.99 1999-09-09

In [ ]:
# sort by doj and sal
df1 = df.sort_values(by=['ename','sal'],ascending=[False,True])
df1

   empid           ename       sal        doj
4   1005  Laxmi Prasanna  12000.75 2000-10-08
3   1004    Hema Chandra  16500.50 2000-09-10
2   1003    Gaurav Gupta  18000.53 2002-03-03
0   1001      Ganesh Rao  10000.00 2000-10-10
1   1002      Anil Kumar  23000.50 2002-03-20
5   1006       Anant Nag   9999.99 1999-09-09

### Excercise
<ol>
    <li> Print salary of Ganesh Rao.
    <li> Print joining date and id of Laxmi Prasanna.
    <li> Print average salary.
</ol>